Repository: roman-gorbachev/OurMemory-ios
Catalog: OurMemory/Resources/Localizable.xcstrings
Source language: ru
Languages: be, en, zh_hans

# troubleshooting_steps
source: Фото или аудио не загружается — проверьте интернет и размер файла. Если ошибка повторяется, попросите разработчика добавить ваш UID в правила Storage. «Нет прав администратора» при входе — в базе нет записи с вашим UID в OurMemory/Admins. Пройдите шаги раздела «Администраторы». Посетитель не видит изменения — приложение загружает данные один раз за запуск, новое появится после перезапуска. Вход администратора на телефоне посетителя сбрасывает его вход через Google. Работайте со своего телефона.
be: Фота або аўдыя не загружаецца — праверце інтэрнэт і памер файла. Калі памылка паўтараецца, папрасіце распрацоўшчыка дадаць ваш UID у правілы Storage. «Няма правоў адміністратара» пры ўваходзе — у базе няма запісу з вашым UID у OurMemory/Admins. Прайдзіце крокі раздзела «Адміністратары». Наведвальнік не бачыць змены — праграма загружае даныя адзін раз за запуск, новае з’явіцца пасля перазапуску. Уваход адміністратара на тэлефоне наведвальніка скідвае яго ўваход праз Google. Працуйце са свайго тэлефона.
en: A photo or audio doesn't upload — check the internet and the file size. If the error repeats, ask the developer to add your UID to the Storage rules. “No administrator rights” on sign-in — the database has no record with your UID in OurMemory/Admins. Follow the steps in the Administrators section. A visitor doesn't see the changes — the app loads data once per launch, new content appears after a restart. An administrator sign-in on a visitor's phone resets their Google sign-in. Work from your own phone.
zh_hans: 照片或音频无法上传——请检查网络和文件大小。如果错误重复出现，请让开发者将您的 UID 添加到 Storage 规则中。 登录时提示“没有管理员权限”——数据库中 OurMemory/Admins 下没有您的 UID。请按“管理员”部分的步骤操作。 访客看不到更改——应用每次启动只加载一次数据，重启后才会显示新内容。 在访客手机上登录管理员会使其 Google 登录失效。请使用自己的手机操作。

# undo
source: Отменить
be: Адмяніць
en: Undo
zh_hans: 撤销

# veteran
source: Ветеран
be: Ветэран
en: Veteran
zh_hans: 老兵

# veteran_cards_count
source: %lld карточки
be: %lld карткі
en: %lld cards
zh_hans: %lld 张卡片

# veteran_steps
source: Админ → Ветераны → «Добавить ветерана». Номер карточки приложение присвоит само. ФИО полностью и годы жизни как на табличке, например «1905–1966». Категория определяет фильтр в списке и на карте: «Герои Советского Союза» или «Деятели искусств». Даты рождения и смерти выберите в календаре: по ним работают блок «В этот день» и напоминания избранного. Выберите место захоронения из списка мест, созданных заранее. Добавьте портрет: лицо по центру, приложение само сожмёт фото. Награды ставятся плюсом и минусом: два ордена Красной Звезды — «2» напротив ордена. Биографию соберите из абзацев и фото с подписями. Стрелки меняют порядок, крестик удаляет блок. Используйте переключатель языка вверху формы, чтобы заполнить переводы: пустые поля показываются на русском.
be: Адмін → Ветэраны → «Дадаць ветэрана». Нумар карткі праграма прысвоіць сама. ПІБ цалкам і гады жыцця як на таблічцы, напрыклад «1905–1966». Катэгорыя вызначае фільтр у спісе і на карце: «Героі Савецкага Саюза» або «Дзеячы мастацтваў». Даты нараджэння і смерці выберыце ў календары: па іх працуюць блок «У гэты дзень» і напаміны абранага. Выберыце месца пахавання са спіса месцаў, створаных загадзя. Дадайце партрэт: твар па цэнтры, праграма сама сцісне фота. Узнагароды ставяцца плюсам і мінусам: два ордэны Чырвонай Зоркі — «2» насупраць ордэна. Біяграфію збярыце з абзацаў і фота з подпісамі. Стрэлкі мяняюць парадак, крыжык выдаляе блок. Выкарыстоўвайце пераключальнік мовы ўверсе формы, каб запоўніць пераклады: пустыя палі паказваюцца па-руску.
en: Admin → Veterans → “Add veteran”. The app assigns the card number itself. Full name and years of life as on the plate, for example “1905–1966”. The category sets the filter in the list and on the map: “Heroes of the Soviet Union” or “Artists”. Pick the dates of birth and death in the calendar: the “On this day” section and favorite reminders rely on them. Choose the burial place from the list of places created in advance. Add a portrait: the face in the center, the app compresses the photo itself. Awards are set with plus and minus: two Orders of the Red Star means “2” next to the order. Build the biography from paragraphs and captioned photos. Arrows change the order, the cross removes a block. Use the language switch at the top of the form to fill in translations: empty fields show the Russian text.
zh_hans: 管理 → 老兵 → “添加老兵”。卡片编号由应用自动分配。 按标牌填写完整姓名和生卒年，例如“1905–1966”。 类别决定列表和地图中的筛选：“苏联英雄”或“艺术家”。 在日历中选择出生和逝世日期：“历史上的今天”和收藏提醒依赖这些日期。 从预先创建的地点列表中选择安葬地点。 添加肖像：脸部居中，应用会自动压缩照片。 荣誉用加号和减号设置：两枚红星勋章即在该勋章旁填“2”。 用段落和带说明的照片组成生平。箭头调整顺序，叉号删除内容块。 用表单顶部的语言切换填写翻译：空字段显示俄语原文。

# veterans
source: Ветераны
be: Ветэраны
en: Veterans
zh_hans: 老兵

# victory_day
source: День Победы
be: Дзень Перамогі
en: Victory Day
zh_hans: 胜利日

# visited
source: Пройдено
be: Пройдзена
en: Visited
zh_hans: 已参观

# visited_of_total
source: Пройдено %1$lld из %2$lld
be: Пройдзена %1$lld з %2$lld
en: Visited %1$lld of %2$lld
zh_hans: 已参观 %1$lld / %2$lld

# voice_over
source: Озвучка
be: Агучка
en: Voice-over
zh_hans: 配音

# voice_over_steps
source: Биография длится 1–3 минуты, остановка экскурсии — 30–90 секунд. Формат mp3 или m4a, размер файла до 50 МБ. Для синтеза речи подойдут ElevenLabs или Yandex SpeechKit. Живой голос на диктофон в тихой комнате часто звучит лучше. Перешлите файл себе на телефон и загрузите кнопкой «Добавить аудио» в карточке ветерана или в остановке.
be: Біяграфія доўжыцца 1–3 хвіліны, прыпынак экскурсіі — 30–90 секунд. Фармат mp3 або m4a, памер файла да 50 МБ. Для сінтэзу маўлення падыдуць ElevenLabs або Yandex SpeechKit. Жывы голас на дыктафон у ціхім пакоі часта гучыць лепш. Перашліце файл сабе на тэлефон і загрузіце кнопкай «Дадаць аўдыя» ў картцы ветэрана або ў прыпынку.
en: A biography lasts 1–3 minutes, a tour stop 30–90 seconds. mp3 or m4a format, file size up to 50 MB. ElevenLabs or Yandex SpeechKit work for speech synthesis. A live voice recorded in a quiet room often sounds better. Send the file to your phone and upload it with “Add audio” in the veteran's card or in the stop.
zh_hans: 生平时长1–3分钟，导览站点30–90秒。 格式为 mp3 或 m4a，文件不超过 50 MB。 可使用 ElevenLabs 或 Yandex SpeechKit 进行语音合成。在安静的房间用录音机录制的真人声音往往效果更好。 将文件发送到手机，然后在老兵卡片或站点中通过“添加音频”上传。

# warHeader
source: Военное кладбище
be: Вайсковыя могілкі
en: Military Cemetery
zh_hans: 军人公墓

# write_to_us
source: Написать нам
be: Напісаць нам
en: Contact us
zh_hans: 联系我们

# wrong_email_or_password_msg
source: Неверный e-mail или пароль
be: Няправільны e-mail або пароль
en: Wrong e-mail or password
zh_hans: 电子邮件或密码错误

# years_of_life
source: Годы жизни
be: Гады жыцця
en: Years of life
zh_hans: 生卒年

# your_name_and_contact
source: Ваше имя и телефон или e-mail
be: Ваша імя і тэлефон або e-mail
en: Your name and phone or e-mail
zh_hans: 您的姓名和电话或电子邮件

# your_reply
source: Ваш ответ: %1$@
be: Ваш адказ: %1$@
en: Your reply: %1$@
zh_hans: 您的回复：%1$@

# za_otvagu
source: Медаль «За отвагу»
be: Медаль «За адвагу»
en: Medal “For Courage”
zh_hans: “英勇”奖章

# za_pobedu_germany
source: Медаль «За победу над Германией в Великой Отечественной войне 1941–1945 гг.»
be: Медаль «За перамогу над Германіяй у Вялікай Айчыннай вайне 1941–1945 гг.»
en: Medal “For the Victory over Germany in the Great Patriotic War 1941–1945”
zh_hans: “1941—1945年伟大卫国战争战胜德国”奖章

# back
source: Назад
en: Back
zh_hans: 返回

# light
source: Светлая
en: Light
zh_hans: 浅色

# map
source: Карта
en: Map
zh_hans: 地图

# paragraph
source: Абзац
en: Paragraph
zh_hans: 段落

# password
source: Пароль
en: Password
zh_hans: 密码

# scheme
source: Схема
en: Map
zh_hans: 地图

# uploading_file
source: Загружаем файл…
en: Uploading file…
zh_hans: 正在上传文件…

source: E-mail
zh_hans: 电子邮件
